000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/РегистрацияОбъектовMagento/РегистрацияОбъектовMagento.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РегистрацияОбъектовMagento</name>
  <resources>
    <name>Выгружен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДатаВыгружен</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачисления</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипРегистрации</name>
    <type>
      <types>EnumRef.ТипыРегистрацииMagento</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/КлючевыеАтрибутыЗаказовПокупателей/КлючевыеАтрибутыЗаказовПокупателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КлючевыеАтрибутыЗаказовПокупателей</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ВнутреннееИзменение</name>
    <comment>Изменение было проведено в среде 1С:Розница</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДатаЗаказаНаСайте</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаИзмененияСтатуса</name>
    <comment>Внешнее управление</comment>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПередачи</name>
    <comment>Внешнее управление</comment>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаРезервированияЗаказа</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДисконтнаяКарта</name>
    <type>
      <types>CatalogRef.ИнформационныеКарты</types>
    </type>
  </resources>
  <resources>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>КоррекцияНачисленийПоПродаже</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </resources>
  <resources>
    <name>МагазинПолучатель</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </resources>
  <resources>
    <name>НомерЗаказаНаСайте</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерЗаказаОсновной</name>
    <comment>MainOrder, специфика Magento</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>Проведен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗаказовПокупателей</types>
    </type>
  </resources>
  <resources>
    <name>СтатусИМ</name>
    <comment>Magento</comment>
    <type>
      <types>EnumRef.СтатусыИнтернетМагазина</types>
    </type>
  </resources>
  <resources>
    <name>СтатусОплаты</name>
    <type>
      <types>EnumRef.СтатусОплаты</types>
    </type>
  </resources>
  <resources>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаДоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаДоставкиОператор</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаДоставкиОплачена</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СуммаОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТипДоставки</name>
    <type>
      <types>EnumRef.ТипДоставкиЗаказПокупателя</types>
    </type>
  </resources>
  <resources>
    <name>ТипОплаты</name>
    <type>
      <types>EnumRef.ТипОплатыЗаказПокупателя</types>
    </type>
  </resources>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияЗаказовПокупателей</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/Enums/ТипыРегистрацииMagento/ТипыРегистрацииMagento.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыРегистрацииMagento</name>
  <enumValues>
    <name>БонусныеНакопления</name>
  </enumValues>
  <enumValues>
    <name>ТоварыНаСкладах</name>
  </enumValues>
  <enumValues>
    <name>ЗаказыПокупателей</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Enums/СтатусыИнтернетМагазина/СтатусыИнтернетМагазина.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыИнтернетМагазина</name>
  <enumValues>
    <name>pending</name>
  </enumValues>
  <enumValues>
    <name>send_to_1c</name>
  </enumValues>
  <enumValues>
    <name>in_complectation</name>
  </enumValues>
  <enumValues>
    <name>delivered</name>
  </enumValues>
  <enumValues>
    <name>canceled</name>
  </enumValues>
  <enumValues>
    <name>paid</name>
  </enumValues>
  <enumValues>
    <name>selection_document_printed</name>
  </enumValues>
  <enumValues>
    <name>sent_to_shop</name>
  </enumValues>
  <enumValues>
    <name>logistic</name>
  </enumValues>
  <enumValues>
    <name>in_moving</name>
  </enumValues>
  <enumValues>
    <name>ready_to_warehouse</name>
  </enumValues>
  <enumValues>
    <name>ready</name>
  </enumValues>
  <enumValues>
    <name>carrier_return_delivered</name>
  </enumValues>
  <enumValues>
    <name>returned_cash</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/РегистрацияОбъектовMagento/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура Регистрация(Объект, ТипРегистрации, ПараметрыРегистрации)	Экспорт

	Если НЕ ПривилегированныйРежим() Тогда

		УстановитьПривилегированныйРежим(Истина);

	КонецЕсли;

	Если НЕ ОбменДаннымиПовтИсп.ЭтоГлавныйУзел() Тогда

		Возврат;

	КонецЕсли;

	#Если _ Тогда
	Объект = Документы.ЗаказПокупателя.СоздатьДокумент();
	#КонецЕсли

	Если ТипРегистрации = Перечисления.ТипыРегистрацииMagento.БонусныеНакопления Тогда

		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ТаблицаШапка.Дата КАК Дата,
		|	ТаблицаШапка.Ссылка КАК Объект,
		|	ТаблицаШапка.СтатусИМ КАК СтатусИМ
		|ПОМЕСТИТЬ Фильтр
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ТаблицаШапка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя.НачислениеБонусныхБаллов КАК ТабличнаяЧасть
		|		ПО ТаблицаШапка.Ссылка = ТабличнаяЧасть.Ссылка
		|ГДЕ
		|	ТаблицаШапка.Ссылка = &Объект
		|	И ТаблицаШапка.Проведен
		|	И НЕ ТабличнаяЧасть.СуммаБонусныхБаллов = 0
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ТаблицаШапка.Дата,
		|	ТаблицаШапка.Ссылка,
		|	ТаблицаШапка.СтатусИМ
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ТаблицаШапка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя.ОплатаБонуснымиБаллами КАК ТабличнаяЧасть
		|		ПО ТаблицаШапка.Ссылка = ТабличнаяЧасть.Ссылка
		|ГДЕ
		|	ТаблицаШапка.Ссылка = &Объект
		|	И ТаблицаШапка.Проведен
		|	И НЕ ТабличнаяЧасть.СуммаБонусныхБаллов = 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ТаблицаКлючевыеАтрибуты.ДатаИзмененияСтатуса ЕСТЬ NULL
		|			ТОГДА Ведущая.Дата
		|		КОГДА ТаблицаКлючевыеАтрибуты.ДатаИзмененияСтатуса = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ТаблицаКлючевыеАтрибуты.Период
		|		ИНАЧЕ ТаблицаКлючевыеАтрибуты.ДатаИзмененияСтатуса
		|	КОНЕЦ КАК ДатаНачисления,
		|	Ведущая.Объект КАК Объект
		|ИЗ
		|	Фильтр КАК Ведущая
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлючевыеАтрибутыЗаказовПокупателей КАК ТаблицаКлючевыеАтрибуты
		|		ПО Ведущая.Объект = ТаблицаКлючевыеАтрибуты.ЗаказПокупателя
		|			И (ТаблицаКлючевыеАтрибуты.СтатусИМ = ЗНАЧЕНИЕ(Перечисление.СтатусыИнтернетМагазина.delivered))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегистрацияОбъектовMagento КАК ТаблицаРегистраций
		|		ПО Ведущая.Объект = ТаблицаРегистраций.Объект
		|			И (ТаблицаРегистраций.ТипРегистрации = &ТипРегистрации)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЧекККМ КАК ТаблицаЧеки
		|		ПО Ведущая.Объект = ТаблицаЧеки.ЗаказПокупателя
		|ГДЕ
		|	ТаблицаРегистраций.Объект ЕСТЬ NULL
		|	И ТаблицаЧеки.Ссылка ЕСТЬ NULL
		|	И ВЫБОР
		|			КОГДА ТаблицаКлючевыеАтрибуты.ЗаказПокупателя ЕСТЬ NULL
		|				ТОГДА Ведущая.СтатусИМ = ЗНАЧЕНИЕ(Перечисление.СтатусыИнтернетМагазина.delivered)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаНачисления,
		|	Объект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ Фильтр"
		);
	//	запросом, собственно, проверяем наличие строк в табличных частях..
	//	а записи в регистре может ещё и не быть!
	//	а так же отсутствие записи в регистрации, плюс к тому отсутствие "на основании" чека ККМ.
		Запрос.УстановитьПараметр("Объект"		  , Объект);
		Запрос.УстановитьПараметр("ТипРегистрации", ТипРегистрации);
		
		РезультатЗапроса = Запрос.Выполнить();

		Если НЕ РезультатЗапроса.Пустой() Тогда

			ДанныеВыборка = РезультатЗапроса.Выбрать();
			ДанныеВыборка.Следующий();

			Если ПараметрыРегистрации.Свойство("ДатаНачисления") И ТипЗнч(ПараметрыРегистрации.ДатаНачисления) = Тип("Дата") Тогда

					ДатаНачисления = ПараметрыРегистрации.ДатаНачисления;

			Иначе	ДатаНачисления = ДанныеВыборка.ДатаНачисления;

			КонецЕсли;

			Если ТипЗнч(ДатаНачисления) = Тип("Дата") И НЕ ДатаНачисления = '00010101' Тогда

				НаборЗаписей = РегистрыСведений.РегистрацияОбъектовMagento.СоздатьНаборЗаписей();
				НаборЗаписей.ОбменДанными.Загрузка = Истина;

				НаборЗаписей.Отбор.Объект.Установить(Объект);
				НаборЗаписей.Отбор.ТипРегистрации.Установить(ТипРегистрации);

				ЗаписьНабора = НаборЗаписей.Добавить();
				ЗаписьНабора.Объект = НаборЗаписей.Отбор.Объект.Значение;
				ЗаписьНабора.ТипРегистрации = НаборЗаписей.Отбор.ТипРегистрации.Значение;

				ЗаписьНабора.ДатаНачисления = ДатаНачисления;
				ЗаписьНабора.ДатаИзменения	= ТекущаяДата();

				НаборЗаписей.Записать();

			КонецЕсли;

		Иначе

			ЗаписьЖурналаРегистрации("РЕГ.MAGENTO", УровеньЖурналаРегистрации.Информация
				, Объект.Метаданные()
				, Объект
				, "Отказано в регистрации для выгрузки в NAV"
			);

		КонецЕсли;

	Иначе


	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
